zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/MIMXRT798S_cm33_core1_COMMON.h
/*
** ###################################################################
**     Processors:          MIMXRT798SGAWBR_cm33_core1
**                          MIMXRT798SGFOB_cm33_core1
**                          MIMXRT798SGVKB_cm33_core1
**
**     Compilers:
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          Keil ARM C/C++ Compiler
**                          MCUXpresso Compiler
**
**     Reference manual:    iMXRT700RM Rev.5, 10/2025
**     Version:             rev. 6.0, 2025-12-29
**     Build:               b260429
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MIMXRT798S_cm33_core1
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-06-06)
**         B0 initial version
**     - rev. 5.0 (2025-11-13)
**         Add puf/sdadc irq and cache64 compatibility macros to common header.
**     - rev. 5.1 (2025-12-08)
**         Update RM version and add pdm irq for hifi1/hifi4.
**     - rev. 6.0 (2025-12-29)
**         Add new part number.
**
** ###################################################################
*/

/*!
 * @file MIMXRT798S_cm33_core1_COMMON.h
 * @version 6.0
 * @date 2025-12-29
 * @brief CMSIS Peripheral Access Layer for MIMXRT798S_cm33_core1
 *
 * CMSIS Peripheral Access Layer for MIMXRT798S_cm33_core1
 */

#if !defined(MIMXRT798S_CM33_CORE1_COMMON_H_)
#define MIMXRT798S_CM33_CORE1_COMMON_H_          /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0600U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 109                /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M33 SV Hard Fault Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M33 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M33 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M33 Usage Fault Interrupt */
  SecureFault_IRQn             = -9,               /**< Cortex-M33 Secure Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M33 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M33 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M33 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M33 System Tick Interrupt */

  /* Device specific interrupts */
  Reserved16_IRQn              = 0,                /**< Reserved interrupt 16 */
  Reserved17_IRQn              = 1,                /**< Reserved interrupt 17 */
  Reserved18_IRQn              = 2,                /**< Reserved interrupt 18 */
  FRO2_IRQn                    = 3,                /**< FRO: 300MHz FRO in VDD1 domain Async interrupt */
  GLIKEY4_IRQn                 = 4,                /**< GLIKEY: Interrupt */
  UTICK1_IRQn                  = 5,                /**< Micro-tick Timer */
  MRT1_IRQn                    = 6,                /**< MRT: Ored Interrupt request */
  CTIMER5_IRQn                 = 7,                /**< CTIMER: Interrupt request */
  CTIMER6_IRQn                 = 8,                /**< CTIMER: Interrupt request */
  CTIMER7_IRQn                 = 9,                /**< CTIMER: Interrupt request */
  LPI2C15_IRQn                 = 10,               /**< LPI2C: Interrupt request */
  LP_FLEXCOMM17_IRQn           = 11,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM18_IRQn           = 12,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM19_IRQn           = 13,               /**< FLEXCOMM: Interrupt request */
  LP_FLEXCOMM20_IRQn           = 14,               /**< FLEXCOMM: Interrupt request */
  ADC_IRQn                     = 15,               /**< ADC0: Interrupt request */
  SDADC_IRQn                   = 16,               /**< SDADC0: Interrupt request */
  GLIKEY1_IRQn                 = 17,               /**< GLIKEY: Interrupt */
  ACMP_IRQn                    = 18,               /**< ACMP: interrupt request */
  PDM_EVENT_IRQn               = 19,               /**< MIC: Interrupt request for read data or Error */
  HYPERVISOR_IRQn              = 20,               /**< SECURE: Sense domain Hypervisor interrupt */
  SECURE_VIOLATION_IRQn        = 21,               /**< SECURE: Sense domain Secure violation interrupt */
  PDM_HWVAD_EVENT_IRQn         = 22,               /**< MIC: Hardware Voice Activity Detector interrupt or error interrupt */
  RTC1_ALARM_IRQn              = 23,               /**< RTC: Alarm interrupt */
  RTC1_IRQn                    = 24,               /**< RTC: wakeup interrupt to Sense domain */
  HIFI1_IRQn                   = 25,               /**< HIFI1: Interrupt request */
  MU1_B_IRQn                   = 26,               /**< MU1: MUB, CPU1 to CPU0 */
  MU2_B_IRQn                   = 27,               /**< MU2: MUB, CPU1  to HiFi4 */
  MU3_A_IRQn                   = 28,               /**< MU3: MUA, CPU1 to HiFi1 */
  PMC_IRQn                     = 29,               /**< PMC: Sense domain Interrupt */
  OS_EVENT_IRQn                = 30,               /**< OSEVENT: Event timer CPU1 Wakeup/interrupt */
  USDHC0_IRQn                  = 31,               /**< USDHC: Interrupt request */
  USDHC1_IRQn                  = 32,               /**< USDHC: Interrupt request */
  I3C2_IRQn                    = 33,               /**< I3C: Interrupt Request */
  USB0_IRQn                    = 34,               /**< USB: HSUSB Interrup request */
  USB1_IRQn                    = 35,               /**< USB: eUSB Interrup request */
  WDT2_IRQn                    = 36,               /**< WDT: Interrupt request */
  WDT3_IRQn                    = 37,               /**< WDT: Interrupt request */
  USBPHY0_IRQn                 = 38,               /**< HSUSBPHY: UTM interrupt request */
  Reserved55_IRQn              = 39,               /**< Reserved interrupt 55 */
  I3C3_IRQn                    = 40,               /**< I3C: Interrupt Request */
  FLEXIO_IRQn                  = 41,               /**< flexio: Interrupt request */
  LCDIF_IRQn                   = 42,               /**< dcn: Interrupt request */
  VGPU_IRQn                    = 43,               /**< VGPU interrupt from graphics core */
  MIPI_IRQn                    = 44,               /**< DSI: Interrupt request */
  EDMA2_CH0_IRQn               = 45,               /**< edma2: Channel 0 interrupt */
  EDMA2_CH1_IRQn               = 46,               /**< edma2: Channel 1 interrupt */
  EDMA2_CH2_IRQn               = 47,               /**< edma2: Channel 2 interrupt */
  EDMA2_CH3_IRQn               = 48,               /**< edma2: Channel 3 interrupt */
  EDMA2_CH4_IRQn               = 49,               /**< edma2: Channel 4 interrupt */
  EDMA2_CH5_IRQn               = 50,               /**< edma2: Channel 5 interrupt */
  EDMA2_CH6_IRQn               = 51,               /**< edma2: Channel 6 interrupt */
  EDMA2_CH7_IRQn               = 52,               /**< edma2: Channel 7 interrupt */
  EDMA3_CH0_IRQn               = 53,               /**< edma3: Channel 0 interrupt */
  EDMA3_CH1_IRQn               = 54,               /**< edma3: Channel 1 interrupt */
  EDMA3_CH2_IRQn               = 55,               /**< edma3: Channel 2 interrupt */
  EDMA3_CH3_IRQn               = 56,               /**< edma3: Channel 3 interrupt */
  EDMA3_CH4_IRQn               = 57,               /**< edma3: Channel 4 interrupt */
  EDMA3_CH5_IRQn               = 58,               /**< edma3: Channel 5 interrupt */
  EDMA3_CH6_IRQn               = 59,               /**< edma3: Channel 6 interrupt */
  EDMA3_CH7_IRQn               = 60,               /**< edma3: Channel 7 interrupt */
  GPIO80_IRQn                  = 61,               /**< rgpio8: Interupt request, channel 0 */
  GPIO81_IRQn                  = 62,               /**< rgpio8: Interupt request, channel 1 */
  GPIO90_IRQn                  = 63,               /**< rgpio9: Interupt request, channel 0 */
  GPIO91_IRQn                  = 64,               /**< rgpio9: Interupt request, channel 1 */
  GPIO100_IRQn                 = 65,               /**< rgpio10: Interupt request, channel 0 */
  GPIO101_IRQn                 = 66,               /**< rgpio10: Interupt request, channel 1 */
  Reserved83_IRQn              = 67,               /**< Reserved interrupt 83 */
  Reserved84_IRQn              = 68,               /**< Reserved interrupt 84 */
  PIN_INT0_IRQn                = 69,               /**< pint1: Interupt request 0 */
  PIN_INT1_IRQn                = 70,               /**< pint1: Interupt request 1 */
  PIN_INT2_IRQn                = 71,               /**< pint1: Interupt request 2 */
  PIN_INT3_IRQn                = 72,               /**< pint1: Interupt request 3 */
  SAI3_IRQn                    = 73,               /**< sai3: TX/RX interrupt */
  XSPI2_IRQn                   = 74,               /**< xspi2: Ored interrupt */
  MMU2_IRQn                    = 75,               /**< mmu2: Interrupt request */
  Reserved92_IRQn              = 76,               /**< Reserved interrupt */
  GDET3_IRQn                   = 77,               /**< GDET3: Interrupt request */
  CDOG3_IRQn                   = 78,               /**< cdog3: Interrupt request */
  CDOG4_IRQn                   = 79,               /**< cdog4: Interrupt request */
  Reserved96_IRQn              = 80,               /**< Reserved interrupt 96 */
  CPU1_IRQn                    = 81,               /**< CTI interrupt request */
  JPEGDEC_IRQn                 = 82,               /**< JPEGDEC Ored context 0-3 interrupt request */
  PNGDEC_IRQn                  = 83,               /**< PNGDEC interrupt request */
  Reserved100_IRQn             = 84,               /**< Reserved interrupt 100 */
  TEMPDET0_IRQn                = 85,               /**< TEMPDET0: Temperature Detect Interrupt request 0 */
  TEMPDET1_IRQn                = 86,               /**< TEMPDET1: Temperature Detect Interrupt request 1 */
  EZHV_IRQn                    = 87,               /**< ezhv: Interrupt request */
  SLEEPCON1_IRQn               = 88,               /**< SLEEPCON_SENSE CPU1 wakeup event */
  PVTS1_CPU1_IRQn              = 89,               /**< PVTS1 CPU1 interrupt */
  Reserved106_IRQn             = 90,               /**< Reserved interrupt 106 */
  PVTS1_HIFI1_IRQn             = 91,               /**< PVTS1 HIFI1 interrupt */
  Reserved108_IRQn             = 92                /**< Reserved interrupt 108 */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M33 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M33 Core Configuration
 * @{
 */

