zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/MIMXRT798S_cm33_core1_COMMON.h
/* CTIMER - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CTIMER5 base address */
  #define CTIMER5_BASE                             (0x50048000u)
  /** Peripheral CTIMER5 base address */
  #define CTIMER5_BASE_NS                          (0x40048000u)
  /** Peripheral CTIMER5 base pointer */
  #define CTIMER5                                  ((CTIMER_Type *)CTIMER5_BASE)
  /** Peripheral CTIMER5 base pointer */
  #define CTIMER5_NS                               ((CTIMER_Type *)CTIMER5_BASE_NS)
  /** Peripheral CTIMER6 base address */
  #define CTIMER6_BASE                             (0x50049000u)
  /** Peripheral CTIMER6 base address */
  #define CTIMER6_BASE_NS                          (0x40049000u)
  /** Peripheral CTIMER6 base pointer */
  #define CTIMER6                                  ((CTIMER_Type *)CTIMER6_BASE)
  /** Peripheral CTIMER6 base pointer */
  #define CTIMER6_NS                               ((CTIMER_Type *)CTIMER6_BASE_NS)
  /** Peripheral CTIMER7 base address */
  #define CTIMER7_BASE                             (0x5004A000u)
  /** Peripheral CTIMER7 base address */
  #define CTIMER7_BASE_NS                          (0x4004A000u)
  /** Peripheral CTIMER7 base pointer */
  #define CTIMER7                                  ((CTIMER_Type *)CTIMER7_BASE)
  /** Peripheral CTIMER7 base pointer */
  #define CTIMER7_NS                               ((CTIMER_Type *)CTIMER7_BASE_NS)
  /** Array initializer of CTIMER peripheral base addresses */
  #define CTIMER_BASE_ADDRS                        { 0u, 0u, 0u, 0u, 0u, CTIMER5_BASE, CTIMER6_BASE, CTIMER7_BASE }
  /** Array initializer of CTIMER peripheral base pointers */
  #define CTIMER_BASE_PTRS                         { (CTIMER_Type *)0u, (CTIMER_Type *)0u, (CTIMER_Type *)0u, (CTIMER_Type *)0u, (CTIMER_Type *)0u, CTIMER5, CTIMER6, CTIMER7 }
  /** Array initializer of CTIMER peripheral base addresses */
  #define CTIMER_BASE_ADDRS_NS                     { 0u, 0u, 0u, 0u, 0u, CTIMER5_BASE_NS, CTIMER6_BASE_NS, CTIMER7_BASE_NS }
  /** Array initializer of CTIMER peripheral base pointers */
  #define CTIMER_BASE_PTRS_NS                      { (CTIMER_Type *)0u, (CTIMER_Type *)0u, (CTIMER_Type *)0u, (CTIMER_Type *)0u, (CTIMER_Type *)0u, CTIMER5_NS, CTIMER6_NS, CTIMER7_NS }
#else
  /** Peripheral CTIMER5 base address */
  #define CTIMER5_BASE                             (0x40048000u)
  /** Peripheral CTIMER5 base pointer */
  #define CTIMER5                                  ((CTIMER_Type *)CTIMER5_BASE)
  /** Peripheral CTIMER6 base address */
  #define CTIMER6_BASE                             (0x40049000u)
  /** Peripheral CTIMER6 base pointer */
  #define CTIMER6                                  ((CTIMER_Type *)CTIMER6_BASE)
  /** Peripheral CTIMER7 base address */
  #define CTIMER7_BASE                             (0x4004A000u)
  /** Peripheral CTIMER7 base pointer */
  #define CTIMER7                                  ((CTIMER_Type *)CTIMER7_BASE)
  /** Array initializer of CTIMER peripheral base addresses */
  #define CTIMER_BASE_ADDRS                        { 0u, 0u, 0u, 0u, 0u, CTIMER5_BASE, CTIMER6_BASE, CTIMER7_BASE }
  /** Array initializer of CTIMER peripheral base pointers */
  #define CTIMER_BASE_PTRS                         { (CTIMER_Type *)0u, (CTIMER_Type *)0u, (CTIMER_Type *)0u, (CTIMER_Type *)0u, (CTIMER_Type *)0u, CTIMER5, CTIMER6, CTIMER7 }
#endif
/** Interrupt vectors for the CTIMER peripheral type */
#define CTIMER_IRQS                              { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, CTIMER5_IRQn, CTIMER6_IRQn, CTIMER7_IRQn }

/* DMA - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral DMA2 base address */
  #define DMA2_BASE                                (0x50300000u)
  /** Peripheral DMA2 base address */
  #define DMA2_BASE_NS                             (0x40300000u)
  /** Peripheral DMA2 base pointer */
  #define DMA2                                     ((DMA_Type *)DMA2_BASE)
  /** Peripheral DMA2 base pointer */
  #define DMA2_NS                                  ((DMA_Type *)DMA2_BASE_NS)
  /** Peripheral DMA3 base address */
  #define DMA3_BASE                                (0x50310000u)
  /** Peripheral DMA3 base address */
  #define DMA3_BASE_NS                             (0x40310000u)
  /** Peripheral DMA3 base pointer */
  #define DMA3                                     ((DMA_Type *)DMA3_BASE)
  /** Peripheral DMA3 base pointer */
  #define DMA3_NS                                  ((DMA_Type *)DMA3_BASE_NS)
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS                           { 0u, 0u, DMA2_BASE, DMA3_BASE }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS                            { (DMA_Type *)0u, (DMA_Type *)0u, DMA2, DMA3 }
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS_NS                        { 0u, 0u, DMA2_BASE_NS, DMA3_BASE_NS }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS_NS                         { (DMA_Type *)0u, (DMA_Type *)0u, DMA2_NS, DMA3_NS }
#else
  /** Peripheral DMA2 base address */
  #define DMA2_BASE                                (0x40300000u)
  /** Peripheral DMA2 base pointer */
  #define DMA2                                     ((DMA_Type *)DMA2_BASE)
  /** Peripheral DMA3 base address */
  #define DMA3_BASE                                (0x40310000u)
  /** Peripheral DMA3 base pointer */
  #define DMA3                                     ((DMA_Type *)DMA3_BASE)
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS                           { 0u, 0u, DMA2_BASE, DMA3_BASE }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS                            { (DMA_Type *)0u, (DMA_Type *)0u, DMA2, DMA3 }
#endif
/** Interrupt vectors for the DMA peripheral type */
#define DMA_IRQS                                 { { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }, { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }, { EDMA2_CH0_IRQn, EDMA2_CH1_IRQn, EDMA2_CH2_IRQn, EDMA2_CH3_IRQn, EDMA2_CH4_IRQn, EDMA2_CH5_IRQn, EDMA2_CH6_IRQn, EDMA2_CH7_IRQn }, { EDMA3_CH0_IRQn, EDMA3_CH1_IRQn, EDMA3_CH2_IRQn, EDMA3_CH3_IRQn, EDMA3_CH4_IRQn, EDMA3_CH5_IRQn, EDMA3_CH6_IRQn, EDMA3_CH7_IRQn } }

/* FLEXIO - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FLEXIO base address */
  #define FLEXIO_BASE                              (0x50416000u)
  /** Peripheral FLEXIO base address */
  #define FLEXIO_BASE_NS                           (0x40416000u)
  /** Peripheral FLEXIO base pointer */
  #define FLEXIO                                   ((FLEXIO_Type *)FLEXIO_BASE)
  /** Peripheral FLEXIO base pointer */
  #define FLEXIO_NS                                ((FLEXIO_Type *)FLEXIO_BASE_NS)
  /** Array initializer of FLEXIO peripheral base addresses */
  #define FLEXIO_BASE_ADDRS                        { FLEXIO_BASE }
  /** Array initializer of FLEXIO peripheral base pointers */
  #define FLEXIO_BASE_PTRS                         { FLEXIO }
  /** Array initializer of FLEXIO peripheral base addresses */
  #define FLEXIO_BASE_ADDRS_NS                     { FLEXIO_BASE_NS }
  /** Array initializer of FLEXIO peripheral base pointers */
  #define FLEXIO_BASE_PTRS_NS                      { FLEXIO_NS }
#else
  /** Peripheral FLEXIO base address */
  #define FLEXIO_BASE                              (0x40416000u)
  /** Peripheral FLEXIO base pointer */
  #define FLEXIO                                   ((FLEXIO_Type *)FLEXIO_BASE)
  /** Array initializer of FLEXIO peripheral base addresses */
  #define FLEXIO_BASE_ADDRS                        { FLEXIO_BASE }
  /** Array initializer of FLEXIO peripheral base pointers */
  #define FLEXIO_BASE_PTRS                         { FLEXIO }
#endif
/** Interrupt vectors for the FLEXIO peripheral type */
#define FLEXIO_IRQS                              { FLEXIO_IRQn }

